/* 
 * File:   Protocal.h 
 * Author: TURONG62
 *
 * Created on 2016年7月2日, 下午3:01
 */
//定义通讯协议的数据
#ifndef PROTOCAL_H
#define	PROTOCAL_H

//定义数据的头尾数组
/******************************模块与仪表的通讯*************************************/
u8 SEND_PROTOCAL[5][20]=
{
    {//天信V1.2获取数据指令
        0x7C, 0x0D, 0x31, 0x30, 0x32,
        0x30, 0x30, 0x30, 0x30, 0x30,
        0x30, 0x30, 0x30, 0x30, 0x30,
        0x30, 0x30, 0x30, 0x30, 0x7D    
    },
    {//天信V1.3获取数据指令
        0xCC, 0x02, 0x30, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0xFE, 0x00, 0xEE
    },
    {   0x02,0x03,0x00,0x01,0x00,0x0B,0x55,0xFE },
    {   0x02,0x03,0x00,0x01,0x00,0x0C,0x14,0x3C },    
    {   0x02,0x03,0x00,0x01,0x00,0x0C,0x14,0x3C },
};
    
const u8 PTL_LOC[6][9] = {//记录各种协议各种数据的头字节，如温度在V1.2协议中的地址是24字节开始 没有参数默认aa
    {4,  12, 24, 32, 40, 0xaa, 0xaa, 48, 0xaa}, 
    //V1.2 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
//    
    {12, 16, 22, 26, 0xaa, 0xaa, 30, 32, 5}, 
    //V1.3 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
    
    {9, 3, 17, 21, 13, 0xaa, 0xaa, 0xaa, 0xaa},
    //A1 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
    
    {11, 3, 19, 23, 15, 0xaa, 0xaa, 0xaa, 0xaa},
    //A2 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
    
    {11, 3, 19, 23, 15, 0xaa, 0xaa, 0xaa, 0xaa},
    //A3 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
    
//    {0, 0, 0, 0, 0, 0, 0, 0, 0},
//    //LUX 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
    
//    {0, 0, 0, 0, 0, 0, 0, 0, 0},
//    //CPU 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
    
//    {0, 0, 0, 0, 0, 0, 0, 0, 0},
//    //A4 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间 
    
    {7, 11, 19, 23, 27, 31, 39, 40, 0} 
//    GPRS 标况瞬时流量 标况累积总量 温度 压力 工况瞬时流量 工况累积总量 报警字 状态字 时间
    
}; //用法Data_table[GPRS][t1]

#endif	/* PROTOCAL_H */



